MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11C0AGV20000/mcu.h
typedef struct stc_intreq_irq29mon_field
{
    union {
        struct {
            __IO  uint32_t  ICU0INT              :4;
            __IO  uint32_t  ICU1INT              :4;
            __IO  uint32_t  ICU2INT              :4;
            __IO  uint32_t  RESERVED0            :20;
        };
        struct {
            __IO  uint32_t  ICU0INT0             :1;
            __IO  uint32_t  ICU0INT1             :1;
            __IO  uint32_t  ICU0INT2             :1;
            __IO  uint32_t  ICU0INT3             :1;
            __IO  uint32_t  ICU1INT0             :1;
            __IO  uint32_t  ICU1INT1             :1;
            __IO  uint32_t  ICU1INT2             :1;
            __IO  uint32_t  ICU1INT3             :1;
            __IO  uint32_t  ICU2INT0             :1;
            __IO  uint32_t  ICU2INT1             :1;
            __IO  uint32_t  ICU2INT2             :1;
            __IO  uint32_t  ICU2INT3             :1;
            __IO  uint32_t  RESERVED1            :20;
        };
    };
} stc_intreq_irq29mon_field_t;

typedef struct stc_intreq_irq30mon_field
{
    union {
        struct {
            __IO  uint32_t  OCU0INT              :6;
            __IO  uint32_t  OCU1INT              :6;
            __IO  uint32_t  OCU2INT              :6;
            __IO  uint32_t  RESERVED0            :14;
        };
        struct {
            __IO  uint32_t  OCU0INT0             :1;
            __IO  uint32_t  OCU0INT1             :1;
            __IO  uint32_t  OCU0INT2             :1;
            __IO  uint32_t  OCU0INT3             :1;
            __IO  uint32_t  OCU0INT4             :1;
            __IO  uint32_t  OCU0INT5             :1;
            __IO  uint32_t  OCU1INT0             :1;
            __IO  uint32_t  OCU1INT1             :1;
            __IO  uint32_t  OCU1INT2             :1;
            __IO  uint32_t  OCU1INT3             :1;
            __IO  uint32_t  OCU1INT4             :1;
            __IO  uint32_t  OCU1INT5             :1;
            __IO  uint32_t  OCU2INT0             :1;
            __IO  uint32_t  OCU2INT1             :1;
            __IO  uint32_t  OCU2INT2             :1;
            __IO  uint32_t  OCU2INT3             :1;
            __IO  uint32_t  OCU2INT4             :1;
            __IO  uint32_t  OCU2INT5             :1;
            __IO  uint32_t  RESERVED1            :14;
        };
    };
} stc_intreq_irq30mon_field_t;

typedef struct stc_intreq_irq31mon_field
{
        __IO  uint32_t  BTINT0                   :1;
        __IO  uint32_t  BTINT1                   :1;
        __IO  uint32_t  BTINT2                   :1;
        __IO  uint32_t  BTINT3                   :1;
        __IO  uint32_t  BTINT4                   :1;
        __IO  uint32_t  BTINT5                   :1;
        __IO  uint32_t  BTINT6                   :1;
        __IO  uint32_t  BTINT7                   :1;
        __IO  uint32_t  BTINT8                   :1;
        __IO  uint32_t  BTINT9                   :1;
        __IO  uint32_t  BTINT10                  :1;
        __IO  uint32_t  BTINT11                  :1;
        __IO  uint32_t  BTINT12                  :1;
        __IO  uint32_t  BTINT13                  :1;
        __IO  uint32_t  BTINT14                  :1;
        __IO  uint32_t  BTINT15                  :1;
        __IO  uint32_t  RESERVED0                :11;
        __IO  uint32_t  FLASHINT                 :1;
        __IO  uint32_t  RESERVED1                :4;
} stc_intreq_irq31mon_field_t;

typedef struct stc_intreq_rcintsel0_field
{
    union {
        struct {
            __IO  uint32_t  INTSEL0              :8;
            __IO  uint32_t  INTSEL1              :8;
            __IO  uint32_t  INTSEL2              :8;
            __IO  uint32_t  INTSEL3              :8;
        };
        struct {
            __IO  uint32_t  INTSEL00             :1;
            __IO  uint32_t  INTSEL01             :1;
            __IO  uint32_t  INTSEL02             :1;
            __IO  uint32_t  INTSEL03             :1;
            __IO  uint32_t  INTSEL04             :1;
            __IO  uint32_t  INTSEL05             :1;
            __IO  uint32_t  INTSEL06             :1;
            __IO  uint32_t  INTSEL07             :1;
            __IO  uint32_t  INTSEL10             :1;
            __IO  uint32_t  INTSEL11             :1;
            __IO  uint32_t  INTSEL12             :1;
            __IO  uint32_t  INTSEL13             :1;
            __IO  uint32_t  INTSEL14             :1;
            __IO  uint32_t  INTSEL15             :1;
            __IO  uint32_t  INTSEL16             :1;
            __IO  uint32_t  INTSEL17             :1;
            __IO  uint32_t  INTSEL20             :1;
            __IO  uint32_t  INTSEL21             :1;
            __IO  uint32_t  INTSEL22             :1;
            __IO  uint32_t  INTSEL23             :1;
            __IO  uint32_t  INTSEL24             :1;
            __IO  uint32_t  INTSEL25             :1;
            __IO  uint32_t  INTSEL26             :1;
            __IO  uint32_t  INTSEL27             :1;
            __IO  uint32_t  INTSEL30             :1;
            __IO  uint32_t  INTSEL31             :1;
            __IO  uint32_t  INTSEL32             :1;
            __IO  uint32_t  INTSEL33             :1;
            __IO  uint32_t  INTSEL34             :1;
            __IO  uint32_t  INTSEL35             :1;
            __IO  uint32_t  INTSEL36             :1;
            __IO  uint32_t  INTSEL37             :1;
        };
    };
} stc_intreq_rcintsel0_field_t;

typedef struct stc_intreq_rcintsel1_field
{
    union {
        struct {
            __IO  uint32_t  INTSEL4              :8;
            __IO  uint32_t  INTSEL5              :8;
            __IO  uint32_t  INTSEL6              :8;
            __IO  uint32_t  INTSEL7              :8;
        };
        struct {
            __IO  uint32_t  INTSEL40             :1;
            __IO  uint32_t  INTSEL41             :1;
            __IO  uint32_t  INTSEL42             :1;
            __IO  uint32_t  INTSEL43             :1;
            __IO  uint32_t  INTSEL44             :1;
            __IO  uint32_t  INTSEL45             :1;
            __IO  uint32_t  INTSEL46             :1;
            __IO  uint32_t  INTSEL47             :1;
            __IO  uint32_t  INTSEL50             :1;
            __IO  uint32_t  INTSEL51             :1;
            __IO  uint32_t  INTSEL52             :1;
            __IO  uint32_t  INTSEL53             :1;
            __IO  uint32_t  INTSEL54             :1;
            __IO  uint32_t  INTSEL55             :1;
            __IO  uint32_t  INTSEL56             :1;
            __IO  uint32_t  INTSEL57             :1;
            __IO  uint32_t  INTSEL60             :1;
            __IO  uint32_t  INTSEL61             :1;
            __IO  uint32_t  INTSEL62             :1;
            __IO  uint32_t  INTSEL63             :1;
            __IO  uint32_t  INTSEL64             :1;
            __IO  uint32_t  INTSEL65             :1;
            __IO  uint32_t  INTSEL66             :1;
            __IO  uint32_t  INTSEL67             :1;
            __IO  uint32_t  INTSEL70             :1;
            __IO  uint32_t  INTSEL71             :1;
            __IO  uint32_t  INTSEL72             :1;
            __IO  uint32_t  INTSEL73             :1;
            __IO  uint32_t  INTSEL74             :1;
            __IO  uint32_t  INTSEL75             :1;
            __IO  uint32_t  INTSEL76             :1;
            __IO  uint32_t  INTSEL77             :1;
        };
    };
} stc_intreq_rcintsel1_field_t;

