MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11C0AGV20000/mcu.h
/*******************************************************************************
* HWWDT Registers HWWDT
*   Register Definition
*******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM0P_HWWDT_WDG_LDR                        *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM0P_HWWDT_WDG_VLR                        *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM0P_HWWDT_WDG_CTL                        *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM0P_HWWDT_WDG_ICL                        *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM0P_HWWDT_WDG_RIS                        *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM0P_HWWDT_WDG_LCK                        *((volatile uint32_t*)(0x40011C00UL))

/*******************************************************************************
* INTREQ Registers INTREQ
*   Register Definition
*******************************************************************************/
#define FM_INTREQ_DRQSEL                          *((volatile uint32_t*)(0x40031000UL))
#define FM0P_INTREQ_DRQSEL                        *((volatile uint32_t*)(0x40031000UL))
#define FM_INTREQ_IRQCMODE                        *((volatile uint32_t*)(0x4003100CUL))
#define FM0P_INTREQ_IRQCMODE                      *((volatile uint32_t*)(0x4003100CUL))
#define FM_INTREQ_EXC02MON                        *((volatile uint32_t*)(0x40031010UL))
#define FM0P_INTREQ_EXC02MON                      *((volatile uint32_t*)(0x40031010UL))
#define FM_INTREQ_IRQ00MON                        *((volatile uint32_t*)(0x40031014UL))
#define FM0P_INTREQ_IRQ00MON                      *((volatile uint32_t*)(0x40031014UL))
#define FM_INTREQ_IRQ01MON                        *((volatile uint32_t*)(0x40031018UL))
#define FM0P_INTREQ_IRQ01MON                      *((volatile uint32_t*)(0x40031018UL))
#define FM_INTREQ_IRQ02MON                        *((volatile uint32_t*)(0x4003101CUL))
#define FM0P_INTREQ_IRQ02MON                      *((volatile uint32_t*)(0x4003101CUL))
#define FM_INTREQ_IRQ03MON                        *((volatile uint32_t*)(0x40031020UL))
#define FM0P_INTREQ_IRQ03MON                      *((volatile uint32_t*)(0x40031020UL))
#define FM_INTREQ_IRQ04MON                        *((volatile uint32_t*)(0x40031024UL))
#define FM0P_INTREQ_IRQ04MON                      *((volatile uint32_t*)(0x40031024UL))
#define FM_INTREQ_IRQ05MON                        *((volatile uint32_t*)(0x40031028UL))
#define FM0P_INTREQ_IRQ05MON                      *((volatile uint32_t*)(0x40031028UL))
#define FM_INTREQ_IRQ06MON                        *((volatile uint32_t*)(0x4003102CUL))
#define FM0P_INTREQ_IRQ06MON                      *((volatile uint32_t*)(0x4003102CUL))
#define FM_INTREQ_IRQ07MON                        *((volatile uint32_t*)(0x40031030UL))
#define FM0P_INTREQ_IRQ07MON                      *((volatile uint32_t*)(0x40031030UL))
#define FM_INTREQ_IRQ08MON                        *((volatile uint32_t*)(0x40031034UL))
#define FM0P_INTREQ_IRQ08MON                      *((volatile uint32_t*)(0x40031034UL))
#define FM_INTREQ_IRQ09MON                        *((volatile uint32_t*)(0x40031038UL))
#define FM0P_INTREQ_IRQ09MON                      *((volatile uint32_t*)(0x40031038UL))
#define FM_INTREQ_IRQ10MON                        *((volatile uint32_t*)(0x4003103CUL))
#define FM0P_INTREQ_IRQ10MON                      *((volatile uint32_t*)(0x4003103CUL))
#define FM_INTREQ_IRQ11MON                        *((volatile uint32_t*)(0x40031040UL))
#define FM0P_INTREQ_IRQ11MON                      *((volatile uint32_t*)(0x40031040UL))
#define FM_INTREQ_IRQ12MON                        *((volatile uint32_t*)(0x40031044UL))
#define FM0P_INTREQ_IRQ12MON                      *((volatile uint32_t*)(0x40031044UL))
#define FM_INTREQ_IRQ13MON                        *((volatile uint32_t*)(0x40031048UL))
#define FM0P_INTREQ_IRQ13MON                      *((volatile uint32_t*)(0x40031048UL))
#define FM_INTREQ_IRQ14MON                        *((volatile uint32_t*)(0x4003104CUL))
#define FM0P_INTREQ_IRQ14MON                      *((volatile uint32_t*)(0x4003104CUL))
#define FM_INTREQ_IRQ15MON                        *((volatile uint32_t*)(0x40031050UL))
#define FM0P_INTREQ_IRQ15MON                      *((volatile uint32_t*)(0x40031050UL))
#define FM_INTREQ_IRQ16MON                        *((volatile uint32_t*)(0x40031054UL))
#define FM0P_INTREQ_IRQ16MON                      *((volatile uint32_t*)(0x40031054UL))
#define FM_INTREQ_IRQ17MON                        *((volatile uint32_t*)(0x40031058UL))
#define FM0P_INTREQ_IRQ17MON                      *((volatile uint32_t*)(0x40031058UL))
#define FM_INTREQ_IRQ18MON                        *((volatile uint32_t*)(0x4003105CUL))
#define FM0P_INTREQ_IRQ18MON                      *((volatile uint32_t*)(0x4003105CUL))
#define FM_INTREQ_IRQ19MON                        *((volatile uint32_t*)(0x40031060UL))
#define FM0P_INTREQ_IRQ19MON                      *((volatile uint32_t*)(0x40031060UL))
#define FM_INTREQ_IRQ20MON                        *((volatile uint32_t*)(0x40031064UL))
#define FM0P_INTREQ_IRQ20MON                      *((volatile uint32_t*)(0x40031064UL))
#define FM_INTREQ_IRQ21MON                        *((volatile uint32_t*)(0x40031068UL))
#define FM0P_INTREQ_IRQ21MON                      *((volatile uint32_t*)(0x40031068UL))
#define FM_INTREQ_IRQ22MON                        *((volatile uint32_t*)(0x4003106CUL))
#define FM0P_INTREQ_IRQ22MON                      *((volatile uint32_t*)(0x4003106CUL))
#define FM_INTREQ_IRQ23MON                        *((volatile uint32_t*)(0x40031070UL))
#define FM0P_INTREQ_IRQ23MON                      *((volatile uint32_t*)(0x40031070UL))
#define FM_INTREQ_IRQ24MON                        *((volatile uint32_t*)(0x40031074UL))
#define FM0P_INTREQ_IRQ24MON                      *((volatile uint32_t*)(0x40031074UL))
#define FM_INTREQ_IRQ25MON                        *((volatile uint32_t*)(0x40031078UL))
#define FM0P_INTREQ_IRQ25MON                      *((volatile uint32_t*)(0x40031078UL))
#define FM_INTREQ_IRQ26MON                        *((volatile uint32_t*)(0x4003107CUL))
#define FM0P_INTREQ_IRQ26MON                      *((volatile uint32_t*)(0x4003107CUL))
#define FM_INTREQ_IRQ27MON                        *((volatile uint32_t*)(0x40031080UL))
#define FM0P_INTREQ_IRQ27MON                      *((volatile uint32_t*)(0x40031080UL))
#define FM_INTREQ_IRQ28MON                        *((volatile uint32_t*)(0x40031084UL))
#define FM0P_INTREQ_IRQ28MON                      *((volatile uint32_t*)(0x40031084UL))
#define FM_INTREQ_IRQ29MON                        *((volatile uint32_t*)(0x40031088UL))
#define FM0P_INTREQ_IRQ29MON                      *((volatile uint32_t*)(0x40031088UL))
#define FM_INTREQ_IRQ30MON                        *((volatile uint32_t*)(0x4003108CUL))
#define FM0P_INTREQ_IRQ30MON                      *((volatile uint32_t*)(0x4003108CUL))
#define FM_INTREQ_IRQ31MON                        *((volatile uint32_t*)(0x40031090UL))
#define FM0P_INTREQ_IRQ31MON                      *((volatile uint32_t*)(0x40031090UL))
#define FM_INTREQ_RCINTSEL0                       *((volatile uint32_t*)(0x40031210UL))
#define FM0P_INTREQ_RCINTSEL0                     *((volatile uint32_t*)(0x40031210UL))
#define FM_INTREQ_RCINTSEL1                       *((volatile uint32_t*)(0x40031214UL))
#define FM0P_INTREQ_RCINTSEL1                     *((volatile uint32_t*)(0x40031214UL))

