MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11C0AGV20000/mcu.h
#define bFM_INTREQ_IRQ19MON_DMAINT                *((volatile  uint8_t *)(0x42620C10UL))
#define bFM0P_INTREQ_IRQ19MON_DMAINT              *((volatile  uint8_t *)(0x42620C10UL))

#define bFM_INTREQ_IRQ20MON_DMAINT                *((volatile  uint8_t *)(0x42620C90UL))
#define bFM0P_INTREQ_IRQ20MON_DMAINT              *((volatile  uint8_t *)(0x42620C90UL))

#define bFM_INTREQ_IRQ21MON_DMAINT                *((volatile  uint8_t *)(0x42620D10UL))
#define bFM0P_INTREQ_IRQ21MON_DMAINT              *((volatile  uint8_t *)(0x42620D10UL))

#define bFM_INTREQ_IRQ22MON_DMAINT                *((volatile  uint8_t *)(0x42620D90UL))
#define bFM0P_INTREQ_IRQ22MON_DMAINT              *((volatile  uint8_t *)(0x42620D90UL))

#define bFM_INTREQ_IRQ23MON_PPGINT00              *((volatile  uint8_t *)(0x42620E00UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT00            *((volatile  uint8_t *)(0x42620E00UL))
#define bFM_INTREQ_IRQ23MON_PPGINT02              *((volatile  uint8_t *)(0x42620E04UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT02            *((volatile  uint8_t *)(0x42620E04UL))
#define bFM_INTREQ_IRQ23MON_PPGINT04              *((volatile  uint8_t *)(0x42620E08UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT04            *((volatile  uint8_t *)(0x42620E08UL))
#define bFM_INTREQ_IRQ23MON_PPGINT08              *((volatile  uint8_t *)(0x42620E0CUL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT08            *((volatile  uint8_t *)(0x42620E0CUL))
#define bFM_INTREQ_IRQ23MON_PPGINT10              *((volatile  uint8_t *)(0x42620E10UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT10            *((volatile  uint8_t *)(0x42620E10UL))
#define bFM_INTREQ_IRQ23MON_PPGINT12              *((volatile  uint8_t *)(0x42620E14UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT12            *((volatile  uint8_t *)(0x42620E14UL))
#define bFM_INTREQ_IRQ23MON_PPGINT16              *((volatile  uint8_t *)(0x42620E18UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT16            *((volatile  uint8_t *)(0x42620E18UL))
#define bFM_INTREQ_IRQ23MON_PPGINT18              *((volatile  uint8_t *)(0x42620E1CUL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT18            *((volatile  uint8_t *)(0x42620E1CUL))
#define bFM_INTREQ_IRQ23MON_PPGINT20              *((volatile  uint8_t *)(0x42620E20UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT20            *((volatile  uint8_t *)(0x42620E20UL))

#define bFM_INTREQ_IRQ24MON_MOSCINT               *((volatile  uint8_t *)(0x42620E80UL))
#define bFM0P_INTREQ_IRQ24MON_MOSCINT             *((volatile  uint8_t *)(0x42620E80UL))
#define bFM_INTREQ_IRQ24MON_SOSCINT               *((volatile  uint8_t *)(0x42620E84UL))
#define bFM0P_INTREQ_IRQ24MON_SOSCINT             *((volatile  uint8_t *)(0x42620E84UL))
#define bFM_INTREQ_IRQ24MON_MPLLINT               *((volatile  uint8_t *)(0x42620E88UL))
#define bFM0P_INTREQ_IRQ24MON_MPLLINT             *((volatile  uint8_t *)(0x42620E88UL))
#define bFM_INTREQ_IRQ24MON_WCINT                 *((volatile  uint8_t *)(0x42620E90UL))
#define bFM0P_INTREQ_IRQ24MON_WCINT               *((volatile  uint8_t *)(0x42620E90UL))
#define bFM_INTREQ_IRQ24MON_RTCINT                *((volatile  uint8_t *)(0x42620E94UL))
#define bFM0P_INTREQ_IRQ24MON_RTCINT              *((volatile  uint8_t *)(0x42620E94UL))

#define bFM_INTREQ_IRQ25MON_ADCINT0               *((volatile  uint8_t *)(0x42620F00UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0             *((volatile  uint8_t *)(0x42620F00UL))
#define bFM_INTREQ_IRQ25MON_ADCINT1               *((volatile  uint8_t *)(0x42620F04UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT1             *((volatile  uint8_t *)(0x42620F04UL))
#define bFM_INTREQ_IRQ25MON_ADCINT2               *((volatile  uint8_t *)(0x42620F08UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT2             *((volatile  uint8_t *)(0x42620F08UL))
#define bFM_INTREQ_IRQ25MON_ADCINT3               *((volatile  uint8_t *)(0x42620F0CUL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT3             *((volatile  uint8_t *)(0x42620F0CUL))
#define bFM_INTREQ_IRQ25MON_ADCINT4               *((volatile  uint8_t *)(0x42620F10UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT4             *((volatile  uint8_t *)(0x42620F10UL))

#define bFM_INTREQ_IRQ26MON_ADCINT0               *((volatile  uint8_t *)(0x42620F80UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT0             *((volatile  uint8_t *)(0x42620F80UL))
#define bFM_INTREQ_IRQ26MON_ADCINT1               *((volatile  uint8_t *)(0x42620F84UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT1             *((volatile  uint8_t *)(0x42620F84UL))
#define bFM_INTREQ_IRQ26MON_ADCINT2               *((volatile  uint8_t *)(0x42620F88UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT2             *((volatile  uint8_t *)(0x42620F88UL))
#define bFM_INTREQ_IRQ26MON_ADCINT3               *((volatile  uint8_t *)(0x42620F8CUL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT3             *((volatile  uint8_t *)(0x42620F8CUL))
#define bFM_INTREQ_IRQ26MON_ADCINT4               *((volatile  uint8_t *)(0x42620F90UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT4             *((volatile  uint8_t *)(0x42620F90UL))

#define bFM_INTREQ_IRQ27MON_ADCINT0               *((volatile  uint8_t *)(0x42621000UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT0             *((volatile  uint8_t *)(0x42621000UL))
#define bFM_INTREQ_IRQ27MON_ADCINT1               *((volatile  uint8_t *)(0x42621004UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT1             *((volatile  uint8_t *)(0x42621004UL))
#define bFM_INTREQ_IRQ27MON_ADCINT2               *((volatile  uint8_t *)(0x42621008UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT2             *((volatile  uint8_t *)(0x42621008UL))
#define bFM_INTREQ_IRQ27MON_ADCINT3               *((volatile  uint8_t *)(0x4262100CUL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT3             *((volatile  uint8_t *)(0x4262100CUL))
#define bFM_INTREQ_IRQ27MON_ADCINT4               *((volatile  uint8_t *)(0x42621010UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT4             *((volatile  uint8_t *)(0x42621010UL))
#define bFM_INTREQ_IRQ27MON_LCDCINT               *((volatile  uint8_t *)(0x42621014UL))
#define bFM0P_INTREQ_IRQ27MON_LCDCINT             *((volatile  uint8_t *)(0x42621014UL))

