MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A11C0AGV20000/mcu.h
#define bFM_MFS3_UART_SMR_SOE                     *((volatile  uint8_t *)(0x42706000UL))
#define bFM0P_MFS3_UART_SMR_SOE                   *((volatile  uint8_t *)(0x42706000UL))
#define bFM_MFS3_UART_SMR_BDS                     *((volatile  uint8_t *)(0x42706008UL))
#define bFM0P_MFS3_UART_SMR_BDS                   *((volatile  uint8_t *)(0x42706008UL))
#define bFM_MFS3_UART_SMR_SBL                     *((volatile  uint8_t *)(0x4270600CUL))
#define bFM0P_MFS3_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4270600CUL))

#define bFM_MFS3_UART_SSR_TBI                     *((volatile  uint8_t *)(0x427060A0UL))
#define bFM0P_MFS3_UART_SSR_TBI                   *((volatile  uint8_t *)(0x427060A0UL))
#define bFM_MFS3_UART_SSR_TDRE                    *((volatile  uint8_t *)(0x427060A4UL))
#define bFM0P_MFS3_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x427060A4UL))
#define bFM_MFS3_UART_SSR_RDRF                    *((volatile  uint8_t *)(0x427060A8UL))
#define bFM0P_MFS3_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x427060A8UL))
#define bFM_MFS3_UART_SSR_ORE                     *((volatile  uint8_t *)(0x427060ACUL))
#define bFM0P_MFS3_UART_SSR_ORE                   *((volatile  uint8_t *)(0x427060ACUL))
#define bFM_MFS3_UART_SSR_FRE                     *((volatile  uint8_t *)(0x427060B0UL))
#define bFM0P_MFS3_UART_SSR_FRE                   *((volatile  uint8_t *)(0x427060B0UL))
#define bFM_MFS3_UART_SSR_PE                      *((volatile  uint8_t *)(0x427060B4UL))
#define bFM0P_MFS3_UART_SSR_PE                    *((volatile  uint8_t *)(0x427060B4UL))
#define bFM_MFS3_UART_SSR_REC                     *((volatile  uint8_t *)(0x427060BCUL))
#define bFM0P_MFS3_UART_SSR_REC                   *((volatile  uint8_t *)(0x427060BCUL))


/*******************************************************************************
* MFT_PPG Registers MFT_PPG
*   Bitband Section
*******************************************************************************/
#define bFM_MFT_PPG_GATEC0_EDGE0                  *((volatile  uint8_t *)(0x42484300UL))
#define bFM0P_MFT_PPG_GATEC0_EDGE0                *((volatile  uint8_t *)(0x42484300UL))
#define bFM_MFT_PPG_GATEC0_STRG0                  *((volatile  uint8_t *)(0x42484304UL))
#define bFM0P_MFT_PPG_GATEC0_STRG0                *((volatile  uint8_t *)(0x42484304UL))
#define bFM_MFT_PPG_GATEC0_EDGE2                  *((volatile  uint8_t *)(0x42484310UL))
#define bFM0P_MFT_PPG_GATEC0_EDGE2                *((volatile  uint8_t *)(0x42484310UL))
#define bFM_MFT_PPG_GATEC0_STRG2                  *((volatile  uint8_t *)(0x42484314UL))
#define bFM0P_MFT_PPG_GATEC0_STRG2                *((volatile  uint8_t *)(0x42484314UL))

#define bFM_MFT_PPG_GATEC12_EDGE12                *((volatile  uint8_t *)(0x42485B00UL))
#define bFM0P_MFT_PPG_GATEC12_EDGE12              *((volatile  uint8_t *)(0x42485B00UL))
#define bFM_MFT_PPG_GATEC12_STRG12                *((volatile  uint8_t *)(0x42485B04UL))
#define bFM0P_MFT_PPG_GATEC12_STRG12              *((volatile  uint8_t *)(0x42485B04UL))
#define bFM_MFT_PPG_GATEC12_EDGE14                *((volatile  uint8_t *)(0x42485B10UL))
#define bFM0P_MFT_PPG_GATEC12_EDGE14              *((volatile  uint8_t *)(0x42485B10UL))
#define bFM_MFT_PPG_GATEC12_STRG14                *((volatile  uint8_t *)(0x42485B14UL))
#define bFM0P_MFT_PPG_GATEC12_STRG14              *((volatile  uint8_t *)(0x42485B14UL))

#define bFM_MFT_PPG_GATEC16_EDGE16                *((volatile  uint8_t *)(0x42486300UL))
#define bFM0P_MFT_PPG_GATEC16_EDGE16              *((volatile  uint8_t *)(0x42486300UL))
#define bFM_MFT_PPG_GATEC16_STRG16                *((volatile  uint8_t *)(0x42486304UL))
#define bFM0P_MFT_PPG_GATEC16_STRG16              *((volatile  uint8_t *)(0x42486304UL))
#define bFM_MFT_PPG_GATEC16_EDGE18                *((volatile  uint8_t *)(0x42486310UL))
#define bFM0P_MFT_PPG_GATEC16_EDGE18              *((volatile  uint8_t *)(0x42486310UL))
#define bFM_MFT_PPG_GATEC16_STRG18                *((volatile  uint8_t *)(0x42486314UL))
#define bFM0P_MFT_PPG_GATEC16_STRG18              *((volatile  uint8_t *)(0x42486314UL))

#define bFM_MFT_PPG_GATEC20_EDGE20                *((volatile  uint8_t *)(0x42486B00UL))
#define bFM0P_MFT_PPG_GATEC20_EDGE20              *((volatile  uint8_t *)(0x42486B00UL))
#define bFM_MFT_PPG_GATEC20_STRG20                *((volatile  uint8_t *)(0x42486B04UL))
#define bFM0P_MFT_PPG_GATEC20_STRG20              *((volatile  uint8_t *)(0x42486B04UL))
#define bFM_MFT_PPG_GATEC20_EDGE22                *((volatile  uint8_t *)(0x42486B10UL))
#define bFM0P_MFT_PPG_GATEC20_EDGE22              *((volatile  uint8_t *)(0x42486B10UL))
#define bFM_MFT_PPG_GATEC20_STRG22                *((volatile  uint8_t *)(0x42486B14UL))
#define bFM0P_MFT_PPG_GATEC20_STRG22              *((volatile  uint8_t *)(0x42486B14UL))

#define bFM_MFT_PPG_GATEC4_EDGE4                  *((volatile  uint8_t *)(0x42484B00UL))
#define bFM0P_MFT_PPG_GATEC4_EDGE4                *((volatile  uint8_t *)(0x42484B00UL))
#define bFM_MFT_PPG_GATEC4_STRG4                  *((volatile  uint8_t *)(0x42484B04UL))
#define bFM0P_MFT_PPG_GATEC4_STRG4                *((volatile  uint8_t *)(0x42484B04UL))
#define bFM_MFT_PPG_GATEC4_EDGE6                  *((volatile  uint8_t *)(0x42484B10UL))
#define bFM0P_MFT_PPG_GATEC4_EDGE6                *((volatile  uint8_t *)(0x42484B10UL))
#define bFM_MFT_PPG_GATEC4_STRG6                  *((volatile  uint8_t *)(0x42484B14UL))
#define bFM0P_MFT_PPG_GATEC4_STRG6                *((volatile  uint8_t *)(0x42484B14UL))

#define bFM_MFT_PPG_GATEC8_EDGE8                  *((volatile  uint8_t *)(0x42485300UL))
#define bFM0P_MFT_PPG_GATEC8_EDGE8                *((volatile  uint8_t *)(0x42485300UL))
#define bFM_MFT_PPG_GATEC8_STRG8                  *((volatile  uint8_t *)(0x42485304UL))
#define bFM0P_MFT_PPG_GATEC8_STRG8                *((volatile  uint8_t *)(0x42485304UL))
#define bFM_MFT_PPG_GATEC8_EDGE10                 *((volatile  uint8_t *)(0x42485310UL))
#define bFM0P_MFT_PPG_GATEC8_EDGE10               *((volatile  uint8_t *)(0x42485310UL))
#define bFM_MFT_PPG_GATEC8_STRG10                 *((volatile  uint8_t *)(0x42485314UL))
#define bFM0P_MFT_PPG_GATEC8_STRG10               *((volatile  uint8_t *)(0x42485314UL))

#define bFM_MFT_PPG_IGBTC_IGBTMD                  *((volatile  uint8_t *)(0x42487000UL))
#define bFM0P_MFT_PPG_IGBTC_IGBTMD                *((volatile  uint8_t *)(0x42487000UL))
#define bFM_MFT_PPG_IGBTC_IGTRGLV                 *((volatile  uint8_t *)(0x42487004UL))
#define bFM0P_MFT_PPG_IGBTC_IGTRGLV               *((volatile  uint8_t *)(0x42487004UL))
#define bFM_MFT_PPG_IGBTC_IGATIH                  *((volatile  uint8_t *)(0x4248701CUL))
#define bFM0P_MFT_PPG_IGBTC_IGATIH                *((volatile  uint8_t *)(0x4248701CUL))

